---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotOffsetBoundary
source: html/e90bb2b2-9b97-d30a-e44d-65b1c4191c04.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotOffsetBoundary Property

Can't create Boundary as an offset of Run Curve

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotOffsetBoundary { get; }
```